import random
def z1():
    sp = [5,3,6,9,2]
    ch = int(input('Введите число: '))

    if ch in sp:
        print('Все числа: ',sp)
        print('Ваше число: ',ch)
        print('Поздравляю, вы угадали число!')
    else:
        print('Все числа: ', sp)
        print('Ваше число: ', ch)
        print('Нет такого числа!')
z1()

def z2():
    import random
    r = int(input('Определите размерность массива: '))
    a = []
    for i in range(1, r + 1):
        a.append(random.randint(1, 10))
    b = []
    for j in range(1, r + 1):
        if a.count(j) > 1:
            b.append(j)
    print(a)
    print(b)
z2()

def z3():
    dn = ('Понедельник', 'Вторник', 'Среда', 'Четверг', 'Пятница', 'Суббота','Воскресенье')
    p = int(input('Сколько выходных в неделю вы хотите?: '))
    for i in range(7):
        r = dn[:-p]
        v = dn[-p:]
    print('Ваши рабочие дни: ', r)
    print('Ваши выходные дни: ', v)
z3()

def z4():
    n1 = ["Шарипова","Иванова","Воробьёва","Коршунова","Войченко","Лебедь","Булашева","Налётова","Павлова","Кованикова"]
    n2 = ["Черепов","Капров","Исхаков","Сергеев","Ханболот","Гринёв","Деменьтьев","Морозов","Иванов","Гобеленов"]
# a)
    sc = tuple(random.sample(n1,5) + random.sample(n2,5))
# b)
    print("Исходный список №1: ", n1)
    print("Исходный список №2: ", n2)
    print("Список спортивной команды: ", sc)
# c)
    print('Длина списка спортивной команды: ',len(sc))
# d)
    print('Отсортированный сп. список: ', sorted(sc))
# e)
    if 'Иванова' in sc:
        print('Да, фамилия "Шарипова" встречается в списке: ', sc.count('Шарипова'), ' раз')
    else:
        print('Нет, фамилия "Шарипова" не входит в список')
z4()