import random

def z1():
    countries_dict = {"Австрия": "Вена", "Бельгия": "Брюссель", "Великобритания": "Лондон",
                 "Германия": "Берлин", "Ирландия": "Дублин", "Лихтенштейн": "Вадуц", "Нидерладны": "Амстердам",
                 "Франция": "Париж", "Белоруссия": "Минск", "Болгария": "София", "Польша": "Варшава",
                  "Чехия": "Прага", "Албания": "Тирана", "Босния и Герцеговина": "Сараево",
                 "Северная Македония": "Скопье", "Сербия": "Белград"}
    print(countries_dict)
    for key in sorted(countries_dict):
        print(key, ' - ', countries_dict[key])
    name = input('Столицу какой страны вы бы хотели узнать? : ')
    if name in countries_dict:
        print(countries_dict[name])
    else:
        print("Такой страны в списке нет")
z1()
def z2():
    sum = 0
    alph = {
        "а": 1,
        "б": 3,
        "в": 1,
        "г": 3,
        "д": 2,
        "е": 1,
        "ё": 3,
        "ж": 5,
        "з": 5,
        "и": 1,
        "й": 4,
        "к": 2,
        "л": 2,
        "м": 2,
        "н": 1,
        "о": 1,
        "п": 2,
        "р": 1,
        "с": 1,
        "т": 1,
        "у": 2,
        "ф": 10,
        "х": 5,
        "ц": 5,
        "ч": 5,
        "ш": 8,
        "щ": 10,
        "ъ": 10,
        "ы": 4,
        "ь": 3,
        "э": 8,
        "ю": 8,
        "я": 3}
    word = input('Введите слово, для распознавания его ценности: ')
    for i in word:
        sum += alph[i.lower()]
    print('Ценность вашего слова: ', sum)
z2()

def z3():
    yaz = ['русский',
           'английский',
           'французский',
           'японский',
           'китайский']
    st = {"Шарипова": random.choice(yaz),
          "Коршунова": random.choice(yaz),
          "Воробьёва": random.choice(yaz),
          "Иванова": random.choice(yaz)}
    print(st)
    q = 0
    print("Студенты знающие Китайский: ")
    for i in st:
        if "китайский" in st[i]:
            q += 1
            print(i)
z3()